pages/search.htm
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-11 Sun 23:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Search Engines!</title>
<meta name="description" content="In the 1990's things were crazy and you never knew what browser would be best for a site...unless they told you ;)" />
<meta name="generator" content="Org Mode" />
<link href="../styles/main.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Search Engines!</h1>
<p>
Admittedly I&rsquo;m not sure how things are really done today, in fact I had <a href="https://forums.onigirionegai.info/viewtopic.php?t=23">a poll up</a>* to ask, but, at least when the internet was young it was really about two things, BBS and Search Engines. In fact, the internet was very daunting when it was only bulletin board systems. Search directories (think something more like early Yahoo!) and search engines (like Google) really helped serve as a portal. It was simple text box on a screen sometimes along with links for other services and popular sites that let the user describe what they were looking for and get results of web sites to visit. Search was where the internet lived in the 90&rsquo;s and it was great! Everything really did feel like it was right at your figure-tips, even if the engines were quite as good as they are now.
</p>

<p>
If you want to know what engines and directories were popular I keep a list in the navigation bar, you may have even seen it if you came here from there. Check them out! Each one is a snap shot of what the engines looked like back in 1996. They may not function well or at all now, but you&rsquo;ll get a good idea of how they felt. Check out the rest of the navigation bar for more information and maybe even some working search engines that work with your old browsers!
</p>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-02-11 Sun 23:11</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.7)</p>
</div>
</body>
</html>